
import pygame
from pygame.locals import *
import sys
import random
import time


pygame.init()
vec = pygame.math.Vector2  

HEIGHT = 450
WIDTH = 400
ACC = 0.5
FRIC = -0.12
FPS = 50


flow =["Свинцовое отравление особенно опасно для экологии тем, что оно накапливается в окружающей среде, а также в живых организмах. В прошлом веке свинец активно использовали в качестве присадок для бензина , но потом были открыты его опасности, и сейчас его использование в этом качестве запрещено.", "В Тихом океане есть мусорное пятно, площадь которого достигает 1,5 млн км², что больше площади большинства стран мира. Течения сносят сюда миллионы тонн мусора ежегодно, и он превратился в подобие мусорного континента.", "Обычные кошки наносят приличный урон экологии на некоторых островах. Попав туда вместе с мореплавателями, они частично одичали, расплодились и заняли свою нишу в местных экосистемах, потеснив или истребив местную фауну.", " В Австралии экологические организации натягивают искусственные лианы над автодорогами, чтобы коалы не рисковали погибнуть, перебегая эти дороги.", "Половина населения Земли пьёт воду, загрязнённую в той или иной степени, а потому небезопасную для здоровья.", "Около 12% поверхности нашей планеты имеют заповедный статус.", "Ежегодно на Земле высаживается лишь около 10% деревьев от того их числа, которое вырубается за тот же срок.", "Лучше всего борьба за экологию идёт в северных странах Европы . В Швеции и Норвегии, например, перерабатывается и повторно используется до 95% мусора, а двигатели внутреннего сгорания там вообще скоро попадут под запрет, уступив место более экологичному транспорту.", "В США проживает около 5% от мирового населения, но эта страна производит до 30% всех мировых отходов.", "Переработка отходов важна не только потому, что это экономит ресурсы, но и потому, что обычный пластик разлагается в природе более 500 лет.", "О состоянии экологии говорит и то, что каждый год на нашей планете вымирает около 30 тысяч видов живых существ. Такими темпами уже к концу XXI века видовое разнообразие сократится вдвое.", "Около 15% всех смертей и смертельных заболеваний в мире вызвано высоким уровнем загрязнения воздуха.", "Повышение средней мировой температуры всего на 3-4 градуса может привести к таянию льдов, глобальному наводнению и исчезновению большей части лесов на Земле.", " Современные автомобили за 100 км пробега выбрасывают в атмосферу в среднем 1,5 кг газообразных отходов.", "Плохая экология действительно убивает. Так, в одном лишь 2015 году, согласно статистике, из-за загрязнения окружающей среды погибло более 9 млн человек.", "Выброшенный пластиковый стаканчик будет разлагаться более 500 лет", "Через некоторые крупные города вроде Кабула и Манилы протекают биологические мёртвые реки, в которых из-за экстремального уровня загрязнения жизни вообще нет.", "Самым грязным в мире воздухом можно подышать даже не в Пекине или в Мумбаи, а в российском Красноярске.", "На каждого человека на Земле приходится около 500-600 м³ израсходованной пресной воды в год, но распределяется она очень неравномерно.", " Один крупный город Африки или Азии вроде Лагоса или Карачи загрязняет окружающую среду больше, чем средняя европейская страна.", "В XX веке экологическая катастрофа разразилась в Австралии из-за того, что дикие кролики, завезённые на этот материк, невероятно расплодились. Справиться с угрозой удалось лишь тогда, когда был создан и распространён особый вирус , который снизил численность кроличьей популяции.", "Самая лучшая экология в мире сохранилась в Тибете . Правда, в последние десятилетия этот регион активно осваивается Китаем, так что местная экосистема в перспективе может оказаться в уязвимом положении.", "Из-за интенсивного земледелия почвы истощаются и превращаются в пустыни . В одном лишь Китае ежегодно опустынивается 1000-2000 км² земли.", "Чистые пруды в Москве ещё в недавнем прошлом были так загрязены, что назывались Погаными.", " Современные исследования показывают, что чрезмерное загрязнение воздуха ведёт к постепенному уменьшению объёма мозга у человека.", "В Швеции, Исландии и некоторых других северных странах отводимое от крематориев тепло используется для обогрева домов. У практичных потомков викингов ничего не пропадает зазря.", "Солнечная энергия является наиболееэкологически чистой, но для производства солнечных панелей всё равно используются продукты переработки нефти.", "Более 50% мирового урожая зерна идёт на корм скоту и на производство биотоплива.", "В некоторых странах Африки экологи намеренно отпиливают слонам бивни, а носорогам – рог, чтобы уберечь этих животных от браконьеров.", "Концентрация углекислого газа в воздухе постоянно растёт, новые рекорды фиксируются каждый год.", "Негативно на экологию влияют некоторые сельскохозяйственные животные. Их популяция исчисляется десятками миллионов, и испускаемые ими газы в таком масштабе действительно загрязняют атмосферу. Сейчас генетики пытаются придумать, как генетически модифицировать коров, чтобы избавить их от этой особенности. Кенгуру, например, не умеют испускать газов вовсе.", " Лишь 8% пресной воды используется в бытовых нуждах. 22% забирает промышленность, а всё остальное расходуется сельским хозяйством.", "Одна из самых глобальных и сложных проблем современной экологии – постепенное повышение уровня кислотности вод Мирового океана. Если ничего не изменится, в будущем это может привести к вымиранию целых экосистем, и, соответственно, к глобальной экологической катастрофе.", "Загрязнение морей и океанов сказывается и на людях, причём самым непосредственным образом. Пластик под воздействием солнечного ультрафиолета распадается на мельчайшие частицы, которые из-за схожести с планктоном поедаются ракообразными и рыбами, которые этих ракообразных едят. Затем эти животные попадают на стол к людям.", "Для производства экологически чистых электромобилей используется масса вредных технологий, загрязняющих окружающую среду. В основном для производства их аккумуляторов.", " Российское озеро Карачай является самым загрязненным в мире, так как с 1951 года оно используется в качестве места захоронения радиоактивных отходов. За всё время его эксплуатации в нём скопилось 150 млн кюри, что эквивалентно 6 Чернобылям. Сейчас озеро полностью изолировано и, можно сказать, засыпано.", "Потребление воды сельским хозяйством можно было бы сократить на треть, просто модернизировав ирригационные системы, но все страны предпочитают экономить.", "Самый большой вред экологии Земли наносят сами люди. При этом численность населения нашей планеты увеличивается примерно на 10 тысяч человек каждый час.", "В последние годы толщине ледового щита Антарктиды уменьшается примерно на 10 см ежегодно.", "Даже в крупном городе с грязным воздухом на улице он всё равно в 20-30 раз чище, чем в плохо проветриваемом помещении.", " Около 35 млн россиян живёт в населённых пунктах, где экология настолько плоха, что степень загрязнения воздуха превышает установленные безопасные нормы.", "Для выращивания 1 килограмма картошки в среднем тратится 120 литров воды, а для получения 1 килограмма говядины – около 13.000 литров, в сотню с лишним раз больше.", "Потребление электроэнергии на работу интернета возрастает в среднем на 10% ежегодно.", "Ежегодно люди по всему миру выбрасывают около 125 млн вполне рабочих смартфонов просто потому, что они надоели своим владельцам, и лишь небольшая часть этого мусора отправляется на повторную переработку.", "К середине XXI века более 50% населения Земли будет испытывать острый дефицит чистой питьевой воды.", " Уже сейчас из-за проблем с экологией каждый шестой человек живёт в условиях, опасных для здоровья.", "Ежедневно из-за загрязнённой воды погибает около 14 тысяч человек. Больше всего – в Азии и Африке, меньше всего – в Европе и Северной Америке.", "За последние полвека площадь ледников в Гималаях уменьшилась примерно на 15%. Она постепенно сокращается почти каждый год.", "Шумовое загрязнение тоже опасно, так как постоянный шум мешает нормальной жизнедеятельности человека и других живых существ.", "За последние 15-20 лет из крупных городов стали массово пропадать тараканы. Многие учёные связывают это явление с ухудшением экологии.", "Световое загрязнение вредит тем, что оно сильно изменяет естественный уровень освещённости и тем самым негативно влияет на биоритмы живых существ."]




FramePerSec = pygame.time.Clock()

#Создаем окно на котором будет игра

displaysurface = pygame.display.set_mode((WIDTH, HEIGHT))
pygame.display.set_caption("Game")
background_image = pygame.image.load("bg.png")
menu_image=pygame.image.load("Menu.png")

class Player(pygame.sprite.Sprite):
          
    #Инициализируем игрока как кота и создаем область реакции персонажа"rect"

    def __init__(self):
        super().__init__()
        self.surf = pygame.image.load("basik.jpg").convert_alpha()
        self.rect = self.surf.get_rect()
        
        self.pos = vec((10, 360))
        self.vel = vec(0, 0)
        self.acc = vec(0, 0)
        self.jumping = False
        self.score = 0
        
#Функция движения нашего котика
        
    def move(self):
        self.acc = vec(0, 0.5)
        pressed_keys = pygame.key.get_pressed()
        
        #Устанавливаем движение на стрелочки вправо и влево
        
        if pressed_keys[K_LEFT]:
            self.acc.x = -ACC
        if pressed_keys[K_RIGHT]:
            self.acc.x = ACC
        
        self.acc.x += self.vel.x * FRIC
        self.vel += self.acc
        self.pos += self.vel + 0.5 * self.acc

        # Позволяем Kity переходить через границы окна на ругую часть экрана
        
        if self.pos.x > WIDTH:
            self.pos.x = 0
        if self.pos.x < 0:
            self.pos.x = WIDTH

        self.rect.midbottom = self.pos

    #Функция прыжка
        
    def jump(self):
        hits = pygame.sprite.spritecollide(self, platforms, False)
        if hits and not self.jumping:
            self.jumping = True
            self.vel.y = -15
    
    def cancel_jump(self):
        if self.jumping:
            if self.vel.y < -3:
                self.vel.y = -3

    #Обновление счета и сдвижения фона вверх
    
    def update(self):
        hits = pygame.sprite.spritecollide(self, platforms, False)
        if self.vel.y > 0:
            if hits:
                if self.pos.y < hits[0].rect.bottom:
                    if hits[0].point == True:  ##
                        hits[0].point = False  ##
                        self.score += 1
                    self.pos.y = hits[0].rect.top + 1
                    self.vel.y = 0
                    self.jumping = False


def facts(y):
    f = pygame.font.SysFont('times new roman', 17)
    g = f.render("Интересный факт", True, (0, 0, 0))
    aa = g.get_rect()
    aa.midtop = (y, 215)
    displaysurface.blit(g, aa.midtop ) 
    text = random.choice(flow)
    text = text.split()
    text = [' '.join(text[x:x+3]) for x in range(0, len(text), 3)]
    x = 235
    for i in range(len(text)):
        f = pygame.font.SysFont('times new roman', 16)
        g = f.render(text[i], True, (255, 255, 255))
        aa = g.get_rect()
        aa.midtop = (y, x)
        displaysurface.blit(g, aa.midtop ) 
        x+=20
        print(text[i])
    pygame.display.update()




#Экран поражения

def youlose():
    displaysurface.blit(pygame.image.load("lose2.png"),  (-25,0))
    facts(10)

    
#Экран победы

def youwin():
    displaysurface.blit(pygame.image.load("win2.png"),  (-25,0))

#Класс для движушихся облачков

class platform(pygame.sprite.Sprite):
    def __init__(self):
        super().__init__()
        self.surf = pygame.image.load("cloudy2.png").convert_alpha()
        self.rect = self.surf.get_rect(center=(random.randint(0, WIDTH - 10),
                                               random.randint(0, HEIGHT - 30)))

        #Используя рандом устанавливаем скорость
        
        self.speed = random.randint(-1, 1)
        self.moving = True
        self.point = True

          
    #Функция их полета
        
    def move(self):
        if self.moving == True:
            self.rect.move_ip(self.speed,0)
            if self.speed > 0 and self.rect.left > WIDTH:
                self.rect.right = 0
            if self.speed < 0 and self.rect.right < 0:
                self.rect.left = WIDTH




def check(platform, groupies):
    if pygame.sprite.spritecollideany(platform, groupies):
        return True
    else:
        for entity in groupies:
            if entity == platform:
                continue
            if (abs(platform.rect.top - entity.rect.bottom) < 40) and (
                    abs(platform.rect.bottom - entity.rect.top) < 40):
                return True
        С = False

#Генератор облаков
        
def plat_gen():
    while len(platforms) < 6:
        width = random.randrange(50, 100)
        p = platform()
        C = True

        while C:
            p = platform()
            p.rect.center = (random.randrange(0, WIDTH - width),
                             random.randrange(-50, 0))
            C = check(p, platforms)
        platforms.add(p)
        all_sprites.add(p)
font_name = pygame.font.match_font('arial')

#Вывод любого текста

def draw_text(surf, text, size, x, y):
    font = pygame.font.Font(font_name, size)
    text_surface = font.render(text, True, 255)
    text_rect = text_surface.get_rect()
    text_rect.midtop = (x, y)
    surf.blit(text_surface, text_rect)


#Основные настройки самой игры

PT1 = platform()
P1 = Player()

PT1.surf = pygame.Surface((WIDTH, 20))
PT1.surf.fill((255, 255, 255))
PT1.rect = PT1.surf.get_rect(center=(WIDTH / 2, HEIGHT - 10))
all_sprites = pygame.sprite.Group()
all_sprites.add(PT1)
all_sprites.add(P1)

platforms = pygame.sprite.Group()
platforms.add(PT1)
PT1.moving = False
PT1.point = False

for x in range(random.randint(4, 5)):
    C = True
    pl = platform()
    while C:
        pl = platform()
        C = check(pl, platforms)
    platforms.add(pl)
    all_sprites.add(pl)

displaysurface.blit(menu_image,  (0,0))

f = pygame.font.SysFont('times new roman', 20)
g = f.render("by Sofa Revak in 2024 May to 1580", True, (255, 255, 255))
aa = g.get_rect()
aa.midtop = (5, 420)
displaysurface.blit(g, aa.midtop ) 
pygame.display.update()
time.sleep(1.5)


#Сам цикл игры
    
while True:
    
    #Ставим фон
          
    displaysurface.blit(background_image,  (-50,-30))

    #Выводим Счет
    
    f = pygame.font.SysFont('times new roman', 50)
    g = f.render(str(P1.score), True, (255, 255, 255))
    aa = g.get_rect()
    aa.midtop = (WIDTH/2, 15)
    displaysurface.blit(g, aa.midtop )  
    P1.update()

    
    #Прописываем что будет если котик будет ниже экрана
    
    if P1.rect.top > HEIGHT:
        for entity in all_sprites:
            entity.kill()
            time.sleep(1)
            displaysurface.fill((255, 153, 255))
            displaysurface.blit(g, aa.midtop)
            youlose()
            pygame.display.update()
            time.sleep(7.5)
            pygame.quit()
            sys.exit()


    #Условия победы
            
    if int(P1.score)> 15:
        for entity in all_sprites:
            entity.kill()
            time.sleep(1)
            displaysurface.fill((255, 255, 255))
            displaysurface.blit(g, aa.midtop)
            youwin()
            pygame.display.update()
            time.sleep(7.5)
            pygame.quit()
            sys.exit()



    #Прописываем управление через стрелочки
    for event in pygame.event.get():
        if event.type == QUIT:
            pygame.quit()
            sys.exit()
        if event.type == pygame.KEYDOWN:
            if event.key == pygame.K_UP:
                P1.jump()
        if event.type == pygame.KEYUP:
            if event.key == pygame.K_UP:
                P1.cancel_jump()


    #Если игрок ниже трети экрана
                
    if P1.rect.top <= HEIGHT / 3:
        P1.pos.y += abs(P1.vel.y)
        for plat in platforms:
            plat.rect.y += abs(P1.vel.y)
            if plat.rect.top >= HEIGHT:
                plat.kill()


    #Генерируем облака
                
    plat_gen()
    displaysurface.blit(background_image,  (-50,-30))
    displaysurface.blit(g, aa.midtop)


    #Каждый объект добавляем на экран
    
    for entity in all_sprites:
        displaysurface.blit(entity.surf, entity.rect)
        entity.move()


    #Обнавляем дисплей
        
    pygame.display.update()
    FramePerSec.tick(FPS)
                                                  #всё






        
